# pandas: A Short Tutorial
-  pandas contains data structures and data manupulation tools for fast and easy data cleaning and analysis. 
-  pandas is often used in tandem with Numpy, scikit-learn and matplotlib. 
-  pandas is designed for working with tabular or heterogeneous data, while Numpy is best suited for working with homegeneous numerical array data.

In [158]:
# import pandas
import pandas as pd
from pandas import Series, DataFrame
# import Numpy
import numpy as np

## pandas Data Structures

### Series
-  A Series is a one-dimensional array-like object containing a sequence of values and data labels (index).
-  Attributes
    - .index returns an *Index* object
    - .values returns an ndarray

In [159]:
# a simple Series; a default index 0 to 3
obj = Series([1, -2, 3, -4])
obj

0    1
1   -2
2    3
3   -4
dtype: int64

In [160]:
# creating a Series with an index
aobj = Series([1, -2, 3, -4], index = ['a', 'c', 'b', 'd'])
aobj

a    1
c   -2
b    3
d   -4
dtype: int64

In [161]:
# Index objects are immutable
print(aobj.index)
aobj.index[1:]

Index(['a', 'c', 'b', 'd'], dtype='object')

Index(['c', 'b', 'd'], dtype='object')

In [162]:
# similar to a dictionary
'a' in aobj

True

In [163]:
# insert an object
aobj['e'] = 5
aobj

a    1
c   -2
b    3
d   -4
e    5
dtype: int64

In [164]:
# delete an object
del aobj['e']
aobj

a    1
c   -2
b    3
d   -4
dtype: int64

In [165]:
# data retrieval by label
print(aobj['c'])
aobj[['a', 'b', 'c']]   # a list of indices

-2

a    1
b    3
c   -2
dtype: int64

In [166]:
# slicing by label
aobj['a':'b']     # the last label is inclusive!

a    1
c   -2
b    3
dtype: int64

In [167]:
# data retrieval by integer position
print(aobj[1])
# slicing
aobj[:2]   # the last integer position is exclusive!

-2

a    1
c   -2
dtype: int64

In [168]:
# revising index
aobj.index = ['e', 'g', 'h', 'f']
aobj

e    1
g   -2
h    3
f   -4
dtype: int64

In [169]:
# .values attribute
aobj.values    # a numpy 1-d array

array([ 1, -2,  3, -4])

In [170]:
# filtering
aobj[aobj > 0]

e    1
h    3
dtype: int64

In [171]:
# vectorization
aobj * 2

e    2
g   -4
h    6
f   -8
dtype: int64

In [172]:
# numpy universal function
np.abs(aobj)

e    1
g    2
h    3
f    4
dtype: int64

In [173]:
# converting a dictionary to a Serie
sdict = {'Mike': 3.4, 'Mary': 3.8, 'David': 3.0, 'Jack': 2.75}
sobj = Series(sdict)
sobj

Mike     3.40
Mary     3.80
David    3.00
Jack     2.75
dtype: float64

In [174]:
# NaN = missing values
sobj2 = pd.Series(sdict, index = ['Alex', 'David', 'Jack', 'Mary','ann'] )
sobj2

Alex      NaN
David    3.00
Jack     2.75
Mary     3.80
ann       NaN
dtype: float64

In [175]:
# isnull() and notnull() detect missing values
print(pd.isnull(sobj2))
print(pd.notnull(sobj2))
sobj2.isnull()

Alex      True
David    False
Jack     False
Mary     False
ann       True
dtype: bool
Alex     False
David     True
Jack      True
Mary      True
ann      False
dtype: bool

Alex      True
David    False
Jack     False
Mary     False
ann       True
dtype: bool

In [176]:
# data alignment 
(sobj + sobj2)/2

Alex      NaN
David    3.00
Jack     2.75
Mary     3.80
Mike      NaN
ann       NaN
dtype: float64

In [177]:
# .name property
sobj.name ='GPA'
sobj.index.name = 'Student'
sobj

Student
Mike     3.40
Mary     3.80
David    3.00
Jack     2.75
Name: GPA, dtype: float64

### DataFrame
-  A DataFrame represents a (two-dimensional) table of data.
-  The DataFrame has both a row and a column index.
-  Attributes
    - .index returns the row index
    - .columns returns the column index
    - .values returns the data as an ndarray

In [178]:
# creating a DataFrame from a dictionary
adict = {'name': ['Mary', 'Betty', 'Jack', 'Scott', 'David', 'Lily'], 'gender': ['F',
          'F', 'M', 'M', 'M', 'F'], 'gpa': [3.5, 3.1, 2.75, 3.8, 2.9, 2.5]}
adf = DataFrame(adict)
adf

    name gender   gpa
0   Mary      F  3.50
1  Betty      F  3.10
2   Jack      M  2.75
3  Scott      M  3.80
4  David      M  2.90
5   Lily      F  2.50

In [179]:
# head and tail methods
print(adf.head())
adf.tail()

    name gender   gpa
0   Mary      F  3.50
1  Betty      F  3.10
2   Jack      M  2.75
3  Scott      M  3.80
4  David      M  2.90

    name gender   gpa
1  Betty      F  3.10
2   Jack      M  2.75
3  Scott      M  3.80
4  David      M  2.90
5   Lily      F  2.50

In [180]:
# NaN = missing values
adf2 = DataFrame(adict, columns = ['name', 'gender', 'gpa', 'major'], 
                    index = ['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
adf2

     name gender   gpa major
S1   Mary      F  3.50   NaN
S2  Betty      F  3.10   NaN
S3   Jack      M  2.75   NaN
S4  Scott      M  3.80   NaN
S5  David      M  2.90   NaN
S6   Lily      F  2.50   NaN

In [181]:
# .columns and .index
print(adf2.columns)
adf2.index

Index(['name', 'gender', 'gpa', 'major'], dtype='object')

Index(['S1', 'S2', 'S3', 'S4', 'S5', 'S6'], dtype='object')

In [182]:
adf2.columns

Index(['name', 'gender', 'gpa', 'major'], dtype='object')

In [183]:
# a column retrieved as a Series
print(adf2['gpa'])   # by dict-like notation
adf2.gpa    # by attribute
adf2['gpa']

S1    3.50
S2    3.10
S3    2.75
S4    3.80
S5    2.90
S6    2.50
Name: gpa, dtype: float64

S1    3.50
S2    3.10
S3    2.75
S4    3.80
S5    2.90
S6    2.50
Name: gpa, dtype: float64

In [184]:
adf2['gpa']

S1    3.50
S2    3.10
S3    2.75
S4    3.80
S5    2.90
S6    2.50
Name: gpa, dtype: float64

In [185]:
# multiple columns
print(adf2[['name', 'gpa']])
adf2[adf2.columns[1:3]]

     name   gpa
S1   Mary  3.50
S2  Betty  3.10
S3   Jack  2.75
S4  Scott  3.80
S5  David  2.90
S6   Lily  2.50

   gender   gpa
S1      F  3.50
S2      F  3.10
S3      M  2.75
S4      M  3.80
S5      M  2.90
S6      F  2.50

In [186]:
adf2.columns[1:3]

Index(['gender', 'gpa'], dtype='object')

In [187]:
# a row retrieved as Series by the loc attribute
adf2.loc['S3']

name      Jack
gender       M
gpa       2.75
major      NaN
Name: S3, dtype: object

In [188]:
# multiple rows 
# when we whant to have the index we use iloc instead of loc
print(adf2.loc[['S1', 'S3']])
print(adf2[1:2])
(adf2['S1':'S3'])   # the last label is inclusive!

    name gender   gpa major
S1  Mary      F  3.50   NaN
S3  Jack      M  2.75   NaN
     name gender  gpa major
S2  Betty      F  3.1   NaN

     name gender   gpa major
S1   Mary      F  3.50   NaN
S2  Betty      F  3.10   NaN
S3   Jack      M  2.75   NaN

In [189]:
# adding a column by assignment
adf2['honor'] = adf2.gpa >= 3.5
adf2

     name gender   gpa major  honor
S1   Mary      F  3.50   NaN   True
S2  Betty      F  3.10   NaN  False
S3   Jack      M  2.75   NaN  False
S4  Scott      M  3.80   NaN   True
S5  David      M  2.90   NaN  False
S6   Lily      F  2.50   NaN  False

In [190]:
# revising a column
major = Series(['MGT', 'MGT', 'ACC', 'FIN', 'FIN', 'ACC'], 
                 index = ['S1', 'S3', 'S4', 'S6', 'S2', 'S5'])
adf2['major'] = major
adf2

     name gender   gpa major  honor
S1   Mary      F  3.50   MGT   True
S2  Betty      F  3.10   FIN  False
S3   Jack      M  2.75   MGT  False
S4  Scott      M  3.80   ACC   True
S5  David      M  2.90   ACC  False
S6   Lily      F  2.50   FIN  False

In [191]:
# deleting columns
del adf2['honor']
adf2

     name gender   gpa major
S1   Mary      F  3.50   MGT
S2  Betty      F  3.10   FIN
S3   Jack      M  2.75   MGT
S4  Scott      M  3.80   ACC
S5  David      M  2.90   ACC
S6   Lily      F  2.50   FIN

In [192]:
# .values attribute returns data as a two-dimensional ndarray
adf2.values

array([['Mary', 'F', 3.5, 'MGT'],
       ['Betty', 'F', 3.1, 'FIN'],
       ['Jack', 'M', 2.75, 'MGT'],
       ['Scott', 'M', 3.8, 'ACC'],
       ['David', 'M', 2.9, 'ACC'],
       ['Lily', 'F', 2.5, 'FIN']], dtype=object)

## Interacting with Data

### Indexing, Selection and Filtering
- Indexing options
    - df[val]  
        - column label or labels: a single column or subset of columns; 
        - boolean array: selected rows;
        - slicing: slicing rows
    - df.loc[val] or df.iloc[where] 
        - a single row or subset of rows
    - df.loc[:, val] or df.iloc[:, where] 
        - a single column or subset of columns
    - df.loc[val_i, val_j] or df.iloc[where_i, where_j]  
        - both rows and columns
   
   
 - .loc for labels and .iloc for integer positions

In [193]:
# Series indexing similar to Numpy array indexing
bobj = Series({val: key for key, val in enumerate('abcde')})
print(bobj)
bobj[1:3]

a    0
b    1
c    2
d    3
e    4
dtype: int64

b    1
c    2
dtype: int64

In [194]:
# Series indexing with index values
bobj[['b', 'c', 'e']]

b    1
c    2
e    4
dtype: int64

In [195]:
# DataFrame indexing by column
bdf = DataFrame({val: [key * m for m in range(4)] for key, val in enumerate('abcde')})
print(bdf)
bdf[['a', 'd']]

   a  b  c  d   e
0  0  0  0  0   0
1  0  1  2  3   4
2  0  2  4  6   8
3  0  3  6  9  12

   a  d
0  0  0
1  0  3
2  0  6
3  0  9

In [196]:
# DataFrame indexing by row
bdf[1:3]

   a  b  c  d  e
1  0  1  2  3  4
2  0  2  4  6  8

In [197]:
# DataFrame masking
bdf[bdf < 5] = 5
bdf

   a  b  c  d   e
0  5  5  5  5   5
1  5  5  5  5   5
2  5  5  5  6   8
3  5  5  6  9  12

In [198]:
# selection both rows and columns with .loc
bdf.loc[[1, 3], ['a', 'e']]

   a   e
1  5   5
3  5  12

In [199]:
# selection by integer position with .iloc
bdf.iloc[[1,3], [2,4]]

   c   e
1  5   5
3  6  12

In [200]:
# slicing
print(bdf.loc[:3, :'d'])    # the last label is inclusive
bdf.iloc[:, :3][bdf.d < 6]    # the last integer position is exclusive

   a  b  c  d
0  5  5  5  5
1  5  5  5  5
2  5  5  5  6
3  5  5  6  9

   a  b  c
0  5  5  5
1  5  5  5

In [201]:
# a single column or subset of columns
print(bdf.loc[:, ['a', 'b']])
bdf.iloc[:, 0:2]

   a  b
0  5  5
1  5  5
2  5  5
3  5  5

   a  b
0  5  5
1  5  5
2  5  5
3  5  5

### Arithmetic Operations and Data Alignment
- Arithmetics between objects with different indexes
    - Index in the result will be the union of the index pairs.
    - Missing values are introduced in the label locations that don't overlap.
- Operations between DataFrame and Series are defined.

In [202]:
# objects with different indexes
df1 = DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = DataFrame({'A': [5, 6]})
print(df1)
print(df2)
df1 + df2    # NA values would be introduced

   A  B
0  1  3
1  2  4
   A
0  5
1  6

   A   B
0  6 NaN
1  8 NaN

In [203]:
df1

   A  B
0  1  3
1  2  4

In [204]:
# a filled value when an axis label is missing in an object
df1.add(df2, fill_value = 0)

   A    B
0  6  3.0
1  8  4.0

In [205]:
df2

   A
0  5
1  6

### Function Applications
- Numpy ufuncs also work with pandas objects.
- apply()

In [206]:
cdf = DataFrame(np.random.randn(3, 4), columns = list('abcd'), 
                   index = list('ABC'))
print(cdf)
np.abs(cdf)

          a         b         c         d
A  1.057806  0.494186 -0.116226 -1.882679
B  0.170471 -0.721081 -1.060942 -0.499975
C -0.490641  0.251536  0.242327 -0.986864

          a         b         c         d
A  1.057806  0.494186  0.116226  1.882679
B  0.170471  0.721081  1.060942  0.499975
C  0.490641  0.251536  0.242327  0.986864

In [207]:
# apply() runs on each column be default
print(cdf.apply(lambda x: x.max() - x.min()))
# apply() runs on each row
cdf.apply(lambda x: x.max() - x.min(), axis = 1)

a    1.548446
b    1.215267
c    1.303269
d    1.382704
dtype: float64

A    2.940485
B    1.231414
C    1.238400
dtype: float64

### Sorting and Ranking
- sort_index()
- sort_values()
- rank()

In [208]:
# sorting by row index
ddf = DataFrame(np.arange(12).reshape((3, 4)), columns = list('bdac'), 
                   index = list('BCA'))
print(ddf)
ddf.sort_index()

   b  d   a   c
B  0  1   2   3
C  4  5   6   7
A  8  9  10  11

   b  d   a   c
A  8  9  10  11
B  0  1   2   3
C  4  5   6   7

In [209]:
# sorting by column index
ddf.sort_index(axis = 1)

    a  b   c  d
B   2  0   3  1
C   6  4   7  5
A  10  8  11  9

In [210]:
# sorting in descending order
ddf.sort_index(ascending = False)

   b  d   a   c
C  4  5   6   7
B  0  1   2   3
A  8  9  10  11

In [211]:
# sorting by a column
ddf.sort_values(by = 'a')
ddf

   b  d   a   c
B  0  1   2   3
C  4  5   6   7
A  8  9  10  11

In [212]:
# sorting by multiple columns
edf = ddf.copy()
edf['d'] = 8
print(edf)
edf.sort_values(['d', 'b'], ascending = False)

   b  d   a   c
B  0  8   2   3
C  4  8   6   7
A  8  8  10  11

   b  d   a   c
A  8  8  10  11
C  4  8   6   7
B  0  8   2   3

In [213]:
# ranks assigned
print(edf)
edf.rank()    # from smallest to largest

   b  d   a   c
B  0  8   2   3
C  4  8   6   7
A  8  8  10  11

     b    d    a    c
B  1.0  2.0  1.0  1.0
C  2.0  2.0  2.0  2.0
A  3.0  2.0  3.0  3.0

In [214]:
edf.rank(method = 'max', ascending = False)   # tie-breaking method: highest rank

     b    d    a    c
B  3.0  3.0  3.0  3.0
C  2.0  3.0  2.0  2.0
A  1.0  3.0  1.0  1.0

## Descriptive Statistics

In [215]:
# summary statistics by column
np.random.seed(12345)
fdf = DataFrame(np.random.randn(4, 3), columns = list('abc'), 
                   index = list('ABCD'))
print(fdf)
print(fdf.sum())
print(fdf.mean())
print(fdf.max())
print(fdf.idxmax())   # index

          a         b         c
A -0.204708  0.478943 -0.519439
B -0.555730  1.965781  1.393406
C  0.092908  0.281746  0.769023
D  1.246435  1.007189 -1.296221
a    0.578905
b    3.733659
c    0.346769
dtype: float64
a    0.144726
b    0.933415
c    0.086692
dtype: float64
a    1.246435
b    1.965781
c    1.393406
dtype: float64
a    D
b    B
c    B
dtype: object

In [216]:
# summary statistics by row
fdf.sum(axis = 1)

A   -0.245203
B    2.803456
C    1.143677
D    0.957403
dtype: float64

In [217]:
# multiple summary statistics
fdf.describe()

              a         b         c
count  4.000000  4.000000  4.000000
mean   0.144726  0.933415  0.086692
std    0.780852  0.753312  1.218321
min   -0.555730  0.281746 -1.296221
25%   -0.292463  0.429644 -0.713634
50%   -0.055900  0.743066  0.124792
75%    0.381290  1.246837  0.925118
max    1.246435  1.965781  1.393406

In [218]:
fdf.loc['A', 'c'] = 'NaN'
print(fdf)
fdf.sum()    # exclusing missing values

          a         b         c
A -0.204708  0.478943       NaN
B -0.555730  1.965781   1.39341
C  0.092908  0.281746  0.769023
D  1.246435  1.007189  -1.29622

a    0.578905
b    3.733659
dtype: float64

In [219]:
# correlation
fdf.a.corr(fdf.b)

-0.25459237040175636

In [220]:
# unique values and value counts
ser3 = Series(['a', 'b', 'a', 'c', 'b', 'a'])
print(ser3.unique())
ser3.value_counts()

['a' 'b' 'c']

a    3
b    2
c    1
dtype: int64

In [221]:
# membership
print(ser3.isin(['b', 'c']))
ser3[ser3.isin(['b', 'c'])]

0    False
1     True
2    False
3     True
4     True
5    False
dtype: bool

1    b
3    c
4    b
dtype: object

In [222]:
# frequency distribution by column
gdf = DataFrame({'q1': [1, 3, 4, 5, 3], 'q2': [2, 2, 3, 5, 1], 
                    'q3': [3, 1, 2, 4, 1]})
print(gdf)
freq = gdf.apply(pd.value_counts).fillna(0)
freq

   q1  q2  q3
0   1   2   3
1   3   2   1
2   4   3   2
3   5   5   4
4   3   1   1

    q1   q2   q3
1  1.0  1.0  2.0
2  0.0  2.0  1.0
3  2.0  1.0  1.0
4  1.0  0.0  1.0
5  1.0  1.0  0.0

In [226]:
# groupby
gdf['q4'] = Series(list('abadb'))
print(gdf)
gdf.groupby('q4').max()
#g = gdf.groupby('q4')
#g.max()

   q1  q2  q3 q4
0   1   2   3  a
1   3   2   1  b
2   4   3   2  a
3   5   5   4  d
4   3   1   1  b

    q1  q2  q3
q4
a    4   3   3
b    3   2   1
d    5   5   4